TodoApp/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "wake up"], ["body", "hello"], ["created_at", "2021-06-24 20:31:02.625419"], ["updated_at", "2021-06-24 20:31:02.625419"]]
---
    def create
        todo = Todo.new(todo_params)
        if todo && todo.save